app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1 ORDER BY created_at DESC  [["author_id", 2]]
---
  def index
    @user = current_user
    @expenses = Expense.where(author_id: @user.id)

SELECT "groups".* FROM "groups" WHERE "groups"."author_id" = $1 AND "groups"."kind" = $2  [["author_id", 1], ["kind", "Expense"]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 1]]
---
  def new
    @user = current_user
    @expense = Expense.new
    @groups = Group.where(author_id: @user.id, kind: 'Expense')

INSERT INTO "expenses" ("author_id", "name", "description", "amount", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "expense_groups" ("expense_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["expense_id", 10], ["group_id", 1], ["created_at", "2022-11-17 19:30:01.739475"], ["updated_at", "2022-11-17 19:30:01.739475"]]
---
  def create
    @user = current_user
    @expense = Expense.new(expense_params)
    @expense.author_id = @user.id
    @group_id = 1

    if @expense.save
      @expense_group = ExpenseGroup.new(expense_id: @expense.id, group_id: @group_id)
      @expense_group.save

SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 2]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 1]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 1]]
---
  def credit
    @user = current_user
    @incomes = Income.where(author_id: @user.id)
    @expenses = Expense.where(author_id: @user.id)
    total_income = 0
    total_expense = 0

    @incomes.each do |income|
      total_income = income.amount + total_income
    end

    @expenses.each do |expense|

SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 1]]
---
  def total_expense
    @user = current_user
    @expenses = Expense.where(author_id: @user.id)
    total_expense = 0

    @expenses.each do |expense|