app/controllers/groups_controller.rb

  def index
    @user = current_user
    @groups = Group.where(author_id: @user.id)
---
SELECT "groups".* FROM "groups" WHERE "groups"."author_id" = $1  [["author_id", 1]]

  def show
    @credit = credit
    @user = current_user
    @group = Group.where(id: params[:id])
    @expense_groups = ExpenseGroup.where(group_id: params[:id])
    @expense = Expense.where(id: @expense_groups.pluck(:expense_id))
    @income_groups = IncomeGroup.where(group_id: params[:id])
    @income = Income.where(id: @income_groups.pluck(:income_id))
    @kind = @group.pluck(:kind)
---
SELECT "expense_groups".* FROM "expense_groups" WHERE "expense_groups"."group_id" = $1  [["group_id", 1]]
SELECT "expense_groups"."expense_id" FROM "expense_groups" WHERE "expense_groups"."group_id" = $1  [["group_id", 1]]
SELECT "income_groups"."income_id" FROM "income_groups" WHERE "income_groups"."group_id" = $1  [["group_id", 1]]
SELECT "groups"."kind" FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]

  def create
    @user = current_user
    @group = Group.new(group_params)
    @group.author_id = @user.id
    if @group.save
---
INSERT INTO "groups" ("name", "icon", "author_id", "kind", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def credit
    @user = current_user
    @incomes = Income.where(author_id: @user.id)
    @expenses = Expense.where(author_id: @user.id)
    total_income = 0
    total_expense = 0

    @incomes.each do |income|
      total_income = income.amount + total_income
    end

    @expenses.each do |expense|
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 1]]