app/controllers/home_controller.rb

  def credit
    @user = current_user
    @incomes = Income.where(author_id: @user.id)
    @expenses = Expense.where(author_id: @user.id)
    total_income = 0
    total_expense = 0

    @incomes.each do |income|
      total_income = income.amount + total_income
    end

    @expenses.each do |expense|
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 1]]

  def income
    @income = Income.where(author_id: @user.id)
    @total_income = 0
    @income.each do |income|
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 1]]

  def expense
    @expense = Expense.where(author_id: @user.id)
    @total_expense = 0
    @expense.each do |expense|
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 1]]