app/controllers/incomes_controller.rb

  def index
    @user = current_user
    @incomes = Income.where(author_id: @user.id)
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1 ORDER BY created_at DESC  [["author_id", 2]]

  def new
    @user = current_user
    @income = Income.new
    @groups = Group.where(author_id: @user.id, kind: 'Income')
---
SELECT "groups".* FROM "groups" WHERE "groups"."author_id" = $1 AND "groups"."kind" = $2  [["author_id", 1], ["kind", "Income"]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 1]]

  def create
    @user = current_user
    @income = Income.new(income_params)
    @income.author_id = @user.id
    @group_id = 3

    if @income.save
      @income_group = IncomeGroup.new(income_id: @income.id, group_id: @group_id)
      @income_group.save
---
INSERT INTO "incomes" ("author_id", "name", "description", "amount", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "income_groups" ("income_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["income_id", 6], ["group_id", 1], ["created_at", "2022-11-17 21:41:28.514594"], ["updated_at", "2022-11-17 21:41:28.514594"]]

  def credit
    @user = current_user
    @incomes = Income.where(author_id: @user.id)
    @expenses = Expense.where(author_id: @user.id)
    total_income = 0
    total_expense = 0

    @incomes.each do |income|
      total_income = income.amount + total_income
    end
    @expenses.each do |expense|
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 2]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 2]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 1]]

  def total_income
    @user = current_user
    @incomes = Income.where(author_id: @user.id)
    total_income = 0

    @incomes.each do |income|
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."author_id" = $1  [["author_id", 1]]