app/controllers/incomes_controller.rb

  def credit
    @user = current_user
    @incomes = Income.where(author_id: @user.id)
    @expenses = Expense.where(author_id: @user.id)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."author_id" = $1  [["author_id", 1]]